### Qus-1) List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
data1 = {'Name': ['John', 'Jane', 'Mike', 'Sara', 'Tom', 'Anna', 'David', 'Maggie', 'Steve', 'Emily', 'Robert', 'Lucy', 'Kate', 'Mark', 'Eva'],
        'Age': [25, 30, 28, 35, 40, 27, 32, 24, 31, 29, 33, 26, 28, 39, 36],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Female', 'Male', 'Female'],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami', 'Seattle', 'Boston', 'San Francisco', 'Dallas', 'Atlanta', 'Washington', 'Denver', 'Philadelphia', 'Austin', 'Portland']}

In [3]:
df1=pd.DataFrame(data1)
df1

      Name  Age  Gender           City
0     John   25    Male       New York
1     Jane   30  Female    Los Angeles
2     Mike   28    Male        Chicago
3     Sara   35  Female        Houston
4      Tom   40    Male          Miami
5     Anna   27  Female        Seattle
6    David   32    Male         Boston
7   Maggie   24  Female  San Francisco
8    Steve   31    Male         Dallas
9    Emily   29  Female        Atlanta
10  Robert   33    Male     Washington
11    Lucy   26  Female         Denver
12    Kate   28  Female   Philadelphia
13    Mark   39    Male         Austin
14     Eva   36  Female       Portland

#### 1) Head:- Show Top Data

In [4]:
df1.head()

   Name  Age  Gender         City
0  John   25    Male     New York
1  Jane   30  Female  Los Angeles
2  Mike   28    Male      Chicago
3  Sara   35  Female      Houston
4   Tom   40    Male        Miami

#### 2) Tail:- Show Last Data

In [5]:
df1.tail()

      Name  Age  Gender          City
10  Robert   33    Male    Washington
11    Lucy   26  Female        Denver
12    Kate   28  Female  Philadelphia
13    Mark   39    Male        Austin
14     Eva   36  Female      Portland

#### 3) Shape:- Show Data Size

In [6]:
df1.shape

(15, 4)

#### 4) Columns:- Show Data Columns

In [7]:
df1.columns

Index(['Name', 'Age', 'Gender', 'City'], dtype='object')

#### 5) Info:- Print a concise summary of a DataFrame

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    15 non-null     object
 1   Age     15 non-null     int64
 2   Gender  15 non-null     object
 3   City    15 non-null     object
dtypes: int64(1), object(3)
memory usage: 608.0+ bytes

### Qus-2) Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
data2 = {'A': [1, 2, 3, 4, 5],
        'B': [6, 7, 8, 9, 10],
        'C': [11, 12, 13, 14, 15]}

In [10]:
df2=pd.DataFrame(data2)
df2

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [11]:
def re_index(x):
    new_index = range(1, len(x)*2, 2)
    x = x.reset_index(drop=True) 
    x.index = new_index 
    return x
df2 = re_index(df2)
df2

   A   B   C
1  1   6  11
3  2   7  12
5  3   8  13
7  4   9  14
9  5  10  15

### Qus-3) You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [12]:
data3 = {'Values':[10, 20, 30, 40, 50],
        'B': [6, 7, 8, 9, 10],
        'C': [11, 12, 13, 14, 15]}

In [13]:
df3= pd.DataFrame(data3)
df3

   Values   B   C
0      10   6  11
1      20   7  12
2      30   8  13
3      40   9  14
4      50  10  15

In [14]:
def sum_col(x):
    s=0
    count=1
    for i in x["Values"]:
        if count<=3:
            s=s+i
            count+=1
    return s
sum_col(df3)

60

### Qus-4) Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
data4= {"Text":["Hey! How's it going?","What's up","Nice to meet you","What's new with you","How's everything going with hobbies?"]}

In [16]:
df4=pd.DataFrame(data4)
df4

                                   Text
0                  Hey! How's it going?
1                             What's up
2                      Nice to meet you
3                   What's new with you
4  How's everything going with hobbies?

In [17]:
def word_count(x):
    l=[]
    for i in x["Text"]:
        a=len(list(i.split(" ")))
        l.append(a)
    return l
word_count(df4)

df4["Word_Count"]=word_count(df4)
df4

                                   Text  Word_Count
0                  Hey! How's it going?           4
1                             What's up           2
2                      Nice to meet you           4
3                   What's new with you           4
4  How's everything going with hobbies?           5

### Qus-5) How are DataFrame.size() and DataFrame.shape() different?

### Ans-5) 
* **Size:-** The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.

* **Shape:-** The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

In [18]:
df1.size

60

In [19]:
df1.shape

(15, 4)

### Qus-6) Which function of pandas do we use to read an excel file?

### Ans-6) The pd.read_excel() function of pandas is used to read an excel file

### Qus-7) You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [20]:
data5= {'Email':["anantshah@gmail.com","john.doe@example.com","shruti@gami.com","amardube@gmail.com","deepaksharma@gmail.com","needhijain@gmail.com"]}

In [21]:
df5=pd.DataFrame(data5)
df5

                    Email
0     anantshah@gmail.com
1    john.doe@example.com
2         shruti@gami.com
3      amardube@gmail.com
4  deepaksharma@gmail.com
5    needhijain@gmail.com

In [22]:
def name(x):
    l=[]
    for i in x["Email"]:
        # print(i)
        a=i.split("@")
        l.append(a[0])
    return l

df5["Username"]=name(df5)
df5

                    Email      Username
0     anantshah@gmail.com     anantshah
1    john.doe@example.com      john.doe
2         shruti@gami.com        shruti
3      amardube@gmail.com      amardube
4  deepaksharma@gmail.com  deepaksharma
5    needhijain@gmail.com    needhijain

### Qus-8) You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [23]:
data6 = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2],}

In [24]:
df6 = pd.DataFrame(data6)
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [25]:
def fun(x):
    a=(x[(x['A']>5) & (x['B']<10)])
    return a
fun(df6)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2